package com.example.reconquista;

public class One_list {
final String [] one_scenario = {
        "Предыстория",

        "Родриго Диас де Вивар родился в семье потомственных дворян чьи корни уходят в глубь веков. Отец Родриго – потомственный дворянин, судья и верный короне человек. Отец Родриго -  де Вивара Диего Лаинес всю свою жизнь посвятил охране границ Кастилии и Навары от набегов мавров. Благодаря высокому социальному статусу Родриго был вхож в кастильский двор и получил образование в монастыре Сан Пелро де Кардена. По-сле смерти отца воспитывался при дворе Фернандо I, а его лучшим другом стал старший сын короля – Санчо. В монастыре Родриго научили читать и писать.\n" +
                "В 1065 году, когда умер король Кастилии Фердинанд I, королевство оказалось в пучине междоусобной войны…." +
                "После смерти короля королевство было поделено между тремя сыновьями. Сама Кастилия отошла к старшему – Санчо, Леон достался среднему – Альфонсо. Ну а младший, Гарсия, получил в свои владения Галисию. ",

        "Междоусобная война",

        "Темная ночь окутала улицы спящего Бургоса. Не спали лишь два челове-ка, два старых друга Родриго и Санчо. Они готовились к неизбежному – войне, войне за воссоединение земель королевства Кастилии.",

        "Санчо: «Я должен вернуть все земли Кастилии, как когда-то было»",

        "Родриго: «Несомненно ты вернёшь все земли, но как? Там твои братья, и они просто так ничего не вернут, на них влияют местные дворяне, что бояться потерять власть»",

        "Санчо: «Значит верну земли огнём и мечом. Я не допущу троецарствия. У Кастилии должен быть одни король – и это я!»\n" +
                "Санчо: «Ты поддержишь меня?»\n",

        "Родриго: «Да»",

        "Санчо: «Тогда я собираю всех своих вассалов»",

        "Родриго: «Прикажешь отправить посла в Леон?»",

        "Санчо: «Сию минуту…»",//10 строка

        "Следующее утро обещало быть хлопотным: рассылка послов к вассалам с призывом собирать свои отряды, сбор податей на войну, сбор провианта, отправка разведчиков в стан врага.",

        "Санчо: «Родриго, у меня для тебя есть задание. Тебе нужно собрать подати на войну. К сожалению, Бургос переживает не самые лучшие времена. У дворян  всегда найдётся чем заплатить, но это может сказаться на походе, некоторые вассалы могут отказаться участвовать в походе что может сказаться на исходе всей компании. Крестьяне же не располагают такими же средствами и это может вызвать бунт, духовенства тоже не мало золота, он они могут также отказаться нам в поддержке. Как видишь, ситуация не из простых. Именно поэтому я поручил задание именно тебе, потому что ты один из немногих кто в сложных ситуациях находил лучший исход»",

        "Родриго: «Я сделаю все что в моих силах….»",

        "Весьма непростая дилемма. Разозлить дворянство – и тогда в пылу боя Родриго попадёт под случайную стрелу. Может быть вытрясти все до последнего реала у крестьян?  Родриго долго думал и предпочел выбрать:",

};
    final String [] one_scenario_aristocracy = {
            "Родриго: «Дворянам следует проявить благородство в столь трудный час» ",

            "Обобрать всех дворян, и сыскать дурную славу среди дворян, или взять плату с одного дворянского рода?",
            //1
            "Родриго: «В этот трудный момент вес дворяне должны доказать свою верность не словами, но делом»",

            "«Бомонты - самый богатый род Кастилии и верный короне человек, и именно он оплатит нам всю войну.» - подумал Родриго.",

            "Родриго: «Собирайте гонца в поместье Монторио господина Бомонта!»",

            "Бомонт будет в ярости, но что поделать? Кастилии нужны реалы. Война обещала быть затяжной и кровавой.",
            "Санчо: «Я надеюсь, что ты просчитал все за и против. Он видный и очень уважаемый человек. Определенно…ему это не понравилось. Это может сказаться на исходе войны. Что ж, придется что-то пообещать взамен.»\n" +
                    "Санчо: «Вассалы уже выдвигаются в Бургос со своими отрядами. Их всех надо обеспечить провизией. К счастью, год выдался урожаем и это не будет большой проблемой»\n",

                "Сбор податей, провизии, армии занял несколько недель. Разведка докладывала о всех действиях противника. Альфонсо успел заручиться поддержкой эмира Толедо – одного из сильнейших лидеров Пиренейского полуострова. Все это не предвещало ничего хорошего. Война будет нелёгкой, а победа все менее достижимой. И вот две армады встретились в Льянтаде. Две армии стояли выстроились в боевые порядки и ждали сигнала, сигнала к атаке. И вот протрубили боевые горны. Порядки Леона двинулись на боевые построения Кастилии. И вот боевые порядки встретились, знамена Леона и Кастилии схлестнулись в кровавом бою. Стрелы осыпали поле боя с обеих сторон. Боевые порядки сталкивались и растворялись словно волны о берег. Оставляя горы тел павших воинов. Боевые порядки Родриго все ближе были к боевым порядкам врага. Чем ближе к врагу, тем сложнее было контролировать боевой строй, сильное давление выбило Родриго из общего строя в небольшой карман, где он оказался один на один со спешившимся всадником с пурпурным львом на груди – гербом Леона. Момент истины – победа или смерть!",

            "Родриго остается только обороняться и выжидать момента. Вихрь ударов не иссякал, а сил больше не становилось. И вот – момент истины клинок занесся над головой Родриго, сконцентрировав остаток сил Родриго попытался парировать и нанести свой удар, но в этот момент в противника влетела стрела в область ключицы. Замах больше не мог угрожать, но затем Родриго ощутил жгучую боль – стрела попала и в него. Стрела попала в грудь, наконечник жёг словно огнём. Это могло значить только одно – стрела отравлена. Сил совсем не осталось и Родриго рухнул, распластавшись на земле. Ему не суждено было узнать кто победил в этой войне.",
                            //1.1.2
            "Родриго: «Победа или смерть!»",

            "Встав в атакующей позиции Родриго, наносил удар за ударом, противник блокировал каждый удар, но каждый последующий блок становился все менее твердым. И вот описав дугу меч опустился на противника, ен успевшего отразить удар, меч опустился с невероятной силой – всадник побежден, но не мертв, скорее оглушен. Родриго победил, но что сделать с побежденным?",
                    //1.1.1


                        //1.1.1.1
            "Пощады не будет. Вновь клинок занесся над головой врага. Он бы не стал играть в поборника милосердия. Горе побежденным!\n",
                //1.1.1.2
            "Дворяне будут не в восторге, но сей трудный час трудно найти другой выход. Сбор податей, провизии, армии занял несколько недель. Разведка докладывала о всех действиях противника Война будет нелёгкой. И вот две армады встретились в окрестностях Льянтаде. Две армии стояли выстроились в боевые порядки и ждали сигнала, сигнала к атаке. И вот протрубили боевые горны. Порядки Леона двинулись на боевые построения Кастилии. И вот боевые порядки встретились, знамена Леона и Кастилии схлестнулись в кровавом бою. Стрелы осыпали поле боя с обеих сторон. Боевые порядки сталкивались и растворялись словно волны о берег. Оставляя горы тел павших воинов. Боевые порядки Родриго все ближе были к боевым порядкам врага. Чем ближе к врагу, тем сложнее было контролировать боевой строй, сильное давление выбило Родриго из общего строя в небольшой карман, где он оказался один на один со спешившимся всадником с пурпурным львом на груди – гербом Леона. Момент истины – победа или смерть!\n",
                //1.2
                "Родриго: «Победа или смерть!»",

            "Встав в атакующей позиции Родриго, наносил удар за ударом, противник блокировал каждый удар, но каждый последующий блок становился все менее твердым. И вот описав дугу меч опустился на противника, ен успевшего отразить удар, меч опустился с невероятной силой – всадник побежден, но не мертв, скорее оглушен. Родриго победил, но что сделать с побежденным?",
                //1.2.1
            "Родриго: «Враг повержен – этого достаточно. Я воин, а не палач»",

            "К концу поединка оказалось, что битва стихла, на поле битвы сояли только алые знамена Кастилии. Победа! Какая победа обходится без трофея? Родриго забрал клинок, с серебряным литым сердечником, который в скором прозовут «Колада» или «Литой». Еще не раз Родриго выйдет победителем из поединков и сражений. Ещё не раз его имя будет наводить ужас на врагов.",
            //1.2.1.1

            "«Победа или смерть» - повторил Родриго.\n" +
                    "Вновь клинок занесся над головой врага. Он бы не стал играть в поборника милосердия. Горе побежденным! Имя Родриго Диаса де Вивара будет вызывать ужас у врагов Кастилии. Имя того, кто безжалостен к побежденным.\n"
    };

    final String [] one_scenario_peasant = {
            "Все трудности всегда ложились на спины крестьян. Этот раз не исключение.",

            "Родриго: «Крестьяне оплатят нам эту компанию»",

            "Санчо: «Это трудный выбор, но, наверное, единственно верный.»",

            "Это может вызвать голодные бунты. Но иного выбора нет. Сбор податей сопровождался волнениями, которые своевременно подавляли. Собрав достаточное количество фуража, армия Кастилии выдвинулась в поход. Пришлось оставить большой гарнизон для подавления бунтов. Две армии встретились недалеко от Саладаньи. Боевые порядки выстроились и пошли вперёд. Шеренги вступали в бой и рассеивались, волна за волной. Строй за строем. Родриго вёл свою шеренгу в бой, прорубая путь к победе. Клином разрывая порядки и нанося удары в самые уязвимы места Родриго отколол часть войск Леона и окружив его уничтожил. Разбив фланг, армия Леона стала уязвима для дальнейших атак. Выбив фалангу строй противника, рассыпался. Все что произошло потом никак иначе кроме как бойня не назвать.  Альфонсо бежал бросив людей поверивших в него на верную смерть. Что дальше?",

            "Родриго: «Мы победили! Победители возвращаются домой!»",

            "Санчо: «Это не первая и не последняя победа Кастилии!»",

            "Войско вернулось в Бургос, где их встретили разоренные, обездоленные, озлобленные люди. С каждым днём напряженность нарастала. Назревал бунт. И вот в один из дней на площади Бургоса собрались обездоленные люди, требующие хлеба. Стража потребовала разойтись, но люди, лишенные последнего куска хлеба, не собирались уходить. В этой напряженной атмосфере люди становились более злыми. Вспыхнуло восстание, охватившее весь город, люди уже ничего не требовали, их охватила жажда крови. Крови тех, кто их грабил поколениями. Родриго бешенная толпа растерзала на площади, ему не помог его клинок, как и многим другим дворянам. Толпа пошла на штурм Замка короля. Через неделю осады замок пал. Еще через месяц город осадил Альфонсо с эмиром Толедо Мутамидом. Город пал, Альфонсо получил его взамен южных территорий Кастилии.",

            "Родриго: «Преследовать! Пока он на свободе он угроза королю.»",

            "Санчо: «Ты прав. Пока он на свободе он может собрать коалицию из дворян и эмиров, пообещав им часть земель Кастилии.»",

            "Погоня длилась недолго. Войско попало в бурю где и сгинуло. Родриго погиб, его тело засыпало песком. Альфонсо смог сбежать. Вернувшись в Леон он вновь собрал армию и выдвинулся в поход на Бургос. Город пал спустя месяц. Его защитники бились до последнего вздоха."

    };


}
